{
  "home": "Home",
  "about_me": "About me",
  "projects": "Projects",
  "contact": "Contact",
  "cv": "CV",

  "welcome": "Hello everyone!",
  "iAm": "I'm",
  "name": "Eduardo Elías Chacón",

  "strings_type": [
    "Full Stack Programmer",
    "Web Developer",
    "Enthusiastic",
    "Innovative",
    "Creative",
    "Passionate about Technology"
  ],

  "home_title_1": "Let Me Introduce Myself",

  "home_text_1": "I am a Full Stack Developer with experience in creating and maintaining web applications. I currently reside in Buenos Aires, Argentina, although I am originally from Mérida, Venezuela. Throughout my career, I have built a solid foundation in various key industry technologies, such as:",
  "home_text_2": "Java, React JS, JavaScript, Astro, Node JS, Spring MVC, Object-Oriented Programming (OOP), SOLID Principles, RESTful APIs, Bootstrap, Tailwind, MySQL, HTML, CSS, GitHub, Vercel, Figma, Postman, WordPress, Trello, Notion, Miro, among others.",
  "home_text_3": "I am committed to quality and optimization, excelling in the implementation of efficient solutions and improving the user experience. My goal is to continue refining my skills to contribute to the success of challenging projects in the IT sector.",
  "home_text_4": "In addition to my technical skills, I have developed competencies in customer service, problem-solving, effective communication, and teamwork, which complement my profile as a developer.",
  "home_text_5": "Eager to take on new challenges and contribute with innovative solutions within dynamic and ever-evolving teams.",

  "about_tile_1": "Additional Information About Me",

  "about_text_1": "I have participated in various training programs that have strengthened my profile as a developer. These programs include:",
  "about_text_2": "Full Stack — Developer Core at 'Digital Nao x Tecmilenio'.",
  "about_text_3": "Full Stack Developer at 'Egg Cooperation'.",
  "about_text_4": "Front-End Developer at 'Eidos Global - Accenture'.",
  "about_text_5": "I studied Electrical Engineering at the University of the Andes in Mérida, Venezuela, which provided me with a strong foundation in logic and problem-solving.",
  "about_text_6": "In addition to my academic background, I have expanded my knowledge through self-learning on educational platforms such as Udemy, FundAula, and Educacion IT.",
  "about_text_7": "I have worked on Personal Projects that have allowed me to apply and strengthen my web programming skills, consolidating my experience in both Front-end and Back-end development.",
  "about_text_8": "These experiences have complemented my technical training, providing me with a comprehensive perspective and essential interpersonal skills for teamwork, effective communication, and project management.",
  "about_text_9": "With solid experience in customer service, I have also worked in roles that require problem-solving skills, clear communication, and the ability to quickly adapt to new technologies and challenges.",

  "tec_skills_title_1": "Technical Skills:",

  "text_skills_tec_1": "Optimal Systems Management",
  "text_skills_tec_2": "Process Optimization",
  "text_skills_tec_3": "Computer Consulting",
  "text_skills_tec_4": "Computer Assistance",
  "text_skills_tec_5": "Customer Service",
  "text_skills_tec_6": "Quality Control",
  "text_skills_tec_7": "Technical Support",

  "soft_skills_title_1": "Soft Skills:",

  "text_skills_soft_1": "Logical and Analytical Thinking",
  "text_skills_soft_2": "Effective Communication",
  "text_skills_soft_3": "Attention to Detail",
  "text_skills_soft_4": "Time Management",
  "text_skills_soft_5": "Teamwork",
  "text_skills_soft_6": "Adaptability",
  "text_skills_soft_7": "Creativity",

  "hobbies_title_1": "Hobbies:",

  "text_hobbie_1": "Photography",
  "text_hobbie_2": "Formula 1",
  "text_hobbie_3": "Baseball",
  "text_hobbie_4": "Football",
  "text_hobbie_5": "Travel",
  "text_hobbie_6": "Rock",

  "title_tech_stack_1": "Professional Skill Set",

  "title_tool_stack_1": "Tools I Use",

  "title_github_1": "GitHub History",

  "title_project_section_1": "My Projects",

  "subtitle_project_section_1": "Here are some projects I have been working on.",

  "projects_section": {
    "title_project_9": "Bariló",
    "description_project_9": "Bariló is an innovative Mobile-First Web-App designed to transform the experience of graduate trips in Argentina, making them accessible and personalized for all students, regardless of their economic situation. Travel companies often offer standardized packages, limiting customization and accessibility. This lack of suitable alternatives intensifies inequalities, highlighting the urgent need for inclusive solutions. Technologies used: React, TypeScript, Tailwind CSS, Java, SpringMVC and PostgreSQL.",
    "github_project_9": "https://github.com/eduardoe92/Barilo-App-Front",
    "link_project_9": "https://barilo.vercel.app",

    "title_project_8": "Flowento",
    "description_project_8": "Flowento is a Mobile-First Web-App created for the Valencia Business Hub. It centralizes and automates event management, solving issues with manual processes, email registrations, and attendance control. It uses technologies like React, Tailwind CSS, Node.js, and PostgreSQL. Flowento facilitates the creation, promotion, registration, and tracking of events, providing real-time metrics and attendance verification, improving the efficiency and profitability of events.",
    "github_project_8": "https://github.com/eduardoe92/Flowento-App-Front",
    "link_project_8": "https://flowento-app.vercel.app",

    "title_project_7": "Frontend Mentor Challenges",
    "description_project_7": "The Frontend Mentor Challenges repository is dedicated to recreating the various challenges from the Frontend Mentor platform. Its main objective is to enhance front-end development skills by tackling real-world design projects. Each challenge is implemented on Vercel. For more information about each challenge, please refer to the corresponding Readme. The technologies used include HTML, CSS, JavaScript, React, among others.",
    "github_project_7": "https://github.com/eduardoe92/Challenge",
    "link_project_7": "https://eduardoe92.github.io/Challenge/",

    "title_project_6": "QR App",
    "description_project_6": "The QR App project is in constant development and focuses on QR code creation. Its goal is to provide users with a smooth, friendly, and enjoyable experience for easily generating QR codes for various applications. Over time, more features will be added to enhance the navigation experience. The application is deployed on Vercel and uses technologies such as React-Vite, JavaScript, Tailwind CSS, HTML, and CSS.",
    "github_project_6": "https://github.com/eduardoe92/URL",
    "link_project_6": "https://urlqr.vercel.app/",

    "title_project_5": "Library",
    "description_project_5": "The Library project is an application to manage a digital library. It allows users to register, update, and manage books, authors, and user accounts. Features include user registration, book and author management, password security, session control, and user roles. It uses Java, Spring Boot, Spring Security, Spring Data JPA, MySQL, Maven, HTML, and Bootstrap to provide a secure and functional platform.",
    "github_project_5": "https://github.com/eduardoe92/LibraryProject",
    "link_project_5": "",

    "title_project_4": "Makisan Tech",
    "description_project_4": "The Makisan-Tech Landing Page, developed with HTML, CSS, and JavaScript, was the result of close collaboration with a team of front-end developers. The main objective was to optimize the user experience, ensuring smooth navigation and an attractive presentation that reflects the company's values. This was achieved through an intuitive design and a well-organized structure that makes it easy to access information.",
    "github_project_4": "https://github.com/eduardoe92/web-makisan-tech",
    "link_project_4": "https://jonathansansok.github.io/web-makisan-tech/",

    "title_project_3": "Caroline Sada",
    "description_project_3": "The Digital Nao Project involved creating a Landing Page for 'Caroline Sada', a professional in Business Administration and Management. HTML, CSS, and Bootstrap technologies were used to ensure an elegant and functional presentation. The website highlights the skills and services offered by Caroline Seda, allowing visitors to get a clear and professional impression of her capabilities.",
    "github_project_3": "https://github.com/eduardoe92/CarolineSada",
    "link_project_3": "https://eduardoe92.github.io/CarolineSada/",

    "title_project_2": "Pokedex",
    "description_project_2": "The Pokedex Project, developed with React, uses the Pokemon API to provide users with access to the specifications of their favorite Pokémon. This application is hosted on Vercel, ensuring a smooth and reliable experience. With a focus on usability and data accuracy, the Pokedex Project is an invaluable tool for both Pokémon enthusiasts and developers. The interface is intuitive and easy to use.",
    "github_project_2": "https://github.com/eduardoe92/Pokedex",
    "link_project_2": "https://pokedex-eduardoe92.vercel.app/",

    "title_project_1": "Rick and Morty",
    "description_project_1": "The Rick and Morty Project, developed with React for the interface and using the series' API, provides users with detailed information about each character. The application is deployed on Vercel, ensuring an interactive, smooth, pleasant, and reliable platform for fans. It allows exploration of the series' universe in a detailed and fun way, offering an enriching and entertaining user experience.",
    "github_project_1": "https://github.com/eduardoe92/ApiRickAndMorty",
    "link_project_1": "https://rickandmorty-seven-virid.vercel.app/"
  },

  "Deployer": "Deploy",

  "contact_title_1": "Thank You for Wanting to Get in Touch with Me",

  "contact_text_1": "I am at your disposal to address any questions or concerns you may have.",
  "contact_text_2": "If you wish to get in touch with me, you can do so through my social media.",
  "contact_text_3": "Please note that my availability may vary, but I will do my best to respond to your message as soon as possible.",
  "contact_text_4": "I look forward to hearing from you soon!",
  "contact_text_5": "Best regards.",

  "form": {
    "form_name": "Name:",
    "form_email": "Mail:",
    "form_subject": "Message:",

    "alert_send": "Message sent succesfully.",
    "alert_fail": "There was a problem sending the message.",

    "form_pre_send": "Send",
    "form_sending": "Sending...",
    "form_error": "Error sending",
    "form_send": "Sent"
  },

  "contact_icon_title_1": "Find Me on My Social Networks",

  "contact_icon_subtitle_1": "Don't hesitate to get in touch with me"
}
