{
  "link_home": "/",
  "link_about": "/about-me",
  "link_projects": "/projects",
  "link_contact": "/contact",
  "link_navigate": "/",

  "home": "Home",
  "about_me": "About me",
  "projects": "Projects",
  "contact": "Contact",

  "welcome": "Hello everyone!",
  "iAm": "I'm",
  "name": "Eduardo Elias Chacón",

  "strings_type": [
    "Full Stack Programmer",
    "Web Developer",
    "Enthusiastic",
    "Innovative",
    "Creative",
    "Passionate about Technology"
  ],

  "home_title_1": "Let Me Introduce Myself",

  "home_text_1": "I am a passionate Web Developer in continuous training. I currently reside in Buenos Aires, Argentina, although I am originally from Mérida, Venezuela. Throughout my journey, I have invested my time in acquiring various knowledge and skills relevant to the industry, which are:",
  "home_text_2": "Java, React, Astro, MySQL, JavaScript, HTML, CSS, Bootstrap, Tailwind-CSS, Spring, WordPress, NodeJS, Postman, Vercel, GitHub, Figma, Jira, Trello, Notion, and Miro.",
  "home_text_3": "I have a deep passion for technology and web development, and I am committed to continuing to learn every day to become an Outstanding Professional in the IT World.",
  "home_text_4": "I am willing to take on New Challenges and be part of innovative teams in the sector.",

  "about_tile_1": "Additional Information About Me",

  "about_text_1": "I have participated in various training programs that have enriched my skill set as a programmer. These programs include:",
  "about_text_2": "Full Stack — Developer Core at 'Digital Nao x Tecmilenio'.",
  "about_text_3": "Full Stack Programmer at 'Egg Cooperation and Argentina Programa'.",
  "about_text_4": "Front End Developer at 'Eidos Global and Accenture'.",
  "about_text_5": "Previously, I was part of the University of the Andes, in Mérida, Venezuela, where I studied Electrical Engineering.",
  "about_text_6": "In addition to my formal education, I have sought to expand my knowledge through self-study on educational platforms such as Udemy, FundAula, and Educacion IT.",
  "about_text_7": "Additionally, I have worked on Personal Projects that have allowed me to apply and strengthen my web programming skills.",

  "soft_skills_title_1": "I Have Skills In:",

  "text_skills_1": "Logical and Analytical Thinking",
  "text_skills_2": "Effective Communication",
  "text_skills_3": "Attention to Detail",
  "text_skills_4": "Time Management",
  "text_skills_5": "Teamwork",
  "text_skills_6": "Adaptability",
  "text_skills_7": "Creativity",

  "hobbies_title_1": "My Hobbies Are:",

  "text_hobbie_1": "I Love Traveling",
  "text_hobbie_2": "Photography",
  "text_hobbie_3": "Formula 1",
  "text_hobbie_4": "Baseball",
  "text_hobbie_5": "Soccer",
  "text_hobbie_6": "Rock Music",

  "title_tech_stack_1": "Professional Skill Set",

  "title_tool_stack_1": "Tools I Use",

  "title_github_1": "GitHub History",

  "title_project_section_1": "My Projects",

  "subtitle_project_section_1": "Here are some projects I have been working on.",

  "projects_section": {
    "title_project_7": "ShopMax",
    "description_project_7": "ShopMax, an e-commerce platform currently in development, is in the implementation phase with a team of programmers. We are using technologies such as React for the user interface, Java for the backend logic, and MySQL for data management. Our goal is to offer an efficient and high-quality online shopping experience that meets the highest standards of today's digital market.",
    "github_project_7": "https://github.com/eduardoe92/tienda",
    "link_project_7": "",

    "title_project_6": "ConsoleLog.Ar",
    "description_project_6": "The official website of the ConsoleLog.Ar brand is currently being developed by a team of specialized programmers. Using core technologies such as HTML, CSS, and JavaScript, we are committed to creating a web platform that reflects the essence and values of our brand, providing an optimal digital experience for our users.",
    "github_project_6": "https://github.com/eduardoe92/consolelog.ar",
    "link_project_6": "https://www.consolelog.ar/",

    "title_project_5": "Pokedex",
    "description_project_5": "The Pokedex Project, developed with React, leverages the Pokemon API to provide users with access to the specifications of their favorite Pokémon. This application is hosted on Vercel, ensuring a smooth and reliable experience. With a focus on usability and data accuracy, the Pokedex Project is an invaluable tool for both Pokémon enthusiasts and developers.",
    "github_project_5": "https://github.com/eduardoe92/Pokedex",
    "link_project_5": "https://pokedex-eduardoe92.vercel.app/",

    "title_project_4": "Caroline Seda",
    "description_project_4": "The Digital Nao Project involved creating a Landing Page for 'Caroline Seda', a professional in Business Administration and Management. Only HTML, CSS, and Bootstrap technologies were used for its development, ensuring an elegant and functional presentation that highlights Ms. Seda's skills and services.",
    "github_project_4": "https://github.com/eduardoe92/CarolineSada",
    "link_project_4": "https://eduardoe92.github.io/CarolineSada/",

    "title_project_3": "Rick and Morty",
    "description_project_3": "The Rick and Morty Project, developed with React for the interface and utilizing the series' API to provide users with detailed information about each character. This application is deployed on Vercel, ensuring an interactive, smooth, enjoyable, and reliable platform for fans to explore the series' universe.",
    "github_project_3": "https://github.com/eduardoe92/ApiRickAndMorty",
    "link_project_3": "https://rickandmorty-seven-virid.vercel.app/",

    "title_project_2": "Makisan Tech",
    "description_project_2": "The Makisan-Tech Landing Page, developed with HTML, CSS, and JavaScript, was the result of close collaboration with a team of front-end developers. Our main goal was to optimize the user experience, ensuring smooth navigation and an attractive presentation that reflects the company's values.",
    "github_project_2": "https://github.com/eduardoe92/web-makisan-tech",
    "link_project_2": "https://jonathansansok.github.io/web-makisan-tech/",

    "title_project_1": "Eidos Global",
    "description_project_1": "For my final project at Eidos Global, I designed a personal presentation page using HTML, CSS, and JavaScript. Implementing an interactive interface was crucial to improving the user experience, ensuring adaptability to different devices through responsive design.",
    "github_project_1": "https://github.com/eduardoe92/ProyectoFinal",
    "link_project_1": "https://eduardoe92.github.io/ProyectoFinal/"
  },

  "Deployer": "Deploy",

  "contact_title_1": "Thank You for Wanting to Get in Touch with Me",

  "contact_text_1": "I am available to address any questions or concerns you may have.",
  "contact_text_2": "If you want to contact me, you can reach out through my social networks.",
  "contact_text_3": "Please note that my availability may vary, but I will do my best to respond to your message as soon as possible.",
  "contact_text_4": "I look forward to hearing from you soon!",
  "contact_text_5": "Best regards.",

  "form":{
    "form_name":"Name",
    "form_email":"Mail",
    "form_subject":"Message",
    "form_message":"Write your message here",

    "alert_send":"Message sent succesfully.",
    "alert_fail":"There was a problem sending the message.",

    "form_send":"Send",
    "form_sending":"Sending..."
  },

  "contact_icon_title_1": "Find Me on My Social Networks",

  "contact_icon_subtitle_1": "Don't hesitate to get in touch with me"
}
