{
  "home": "Inicio",
  "about_me": "Acerca de",
  "projects": "Proyectos",
  "contact": "Contacto",
  "cv": "CV",

  "welcome": "Hola a todos!",
  "iAm": "Soy",
  "name": "Eduardo Elías Chacón",

  "strings_type": [
    "Programador Full Stack",
    "Desarrollador Web",
    "Entusiasta",
    "Innovador",
    "Creativo",
    "Apasionado por la Tecnología"
  ],

  "home_title_1": "Permíteme Presentarme",

  "home_text_1": "Soy un Desarrollador Full Stack con experiencia en la creación y mantenimiento de aplicaciones web. Actualmente resido en Buenos Aires, Argentina, aunque soy originario de Mérida, Venezuela. A lo largo de mi carrera, he adquirido una sólida base en diversas tecnologías clave para la industria, como:",
  "home_text_2": "Java, React JS, JavaScript, TypeScript, Node JS, Spring MVC, Programación Orientada a Objetos (POO), Microservicios, Principios SOLID, APIs RESTful, Bootstrap, Tailwind, MySQL, HTML, CSS, GitHub, Vercel, Figma, Postman, WordPress, Trello, Notion, Miro, entre otras.",
  "home_text_3": "Estoy comprometido con la calidad y la optimización, destacándome en la implementación de soluciones eficientes y la mejora de la experiencia del usuario. Mi objetivo es seguir perfeccionando mis habilidades para contribuir al éxito de proyectos desafiantes en el sector IT.",
  "home_text_4": "Además de mis habilidades técnicas, he desarrollado competencias en atención al cliente, manejo de resolución de problemas, comunicación efectiva y el trabajo en equipo, lo que complementa mi perfil como desarrollador.",
  "home_text_5": "Dispuesto para asumir nuevos desafíos y contribuir con soluciones innovadoras dentro de equipos dinámicos y en constante evolución.",

  "about_tile_1": "Información adicional acerca de mí",

  "about_text_1": "He participado en diversos programas de formación que han fortalecido mi perfil como desarrollador. Estos programas incluyen:",
  "about_text_2": "Full Stack — Developer Core en 'Digital Nao x Tecmilenio'.",
  "about_text_3": "Programador Full Stack en 'Egg Cooperation'.",
  "about_text_4": "Desarrollador Front-End en 'Eidos Global - Accenture'.",
  "about_text_5": "Estudié Ingeniería Eléctrica en la Universidad de los Andes, en Mérida, Venezuela, lo que me brindó una base sólida en lógica y resolución de problemas.",
  "about_text_6": "Además de mi formación académica, he ampliado mis conocimientos de manera autodidacta a través de plataformas educativas como Udemy, FundAula, y Educacion IT.",
  "about_text_7": "He desarrollado Proyectos Personales que me han permitido aplicar y reforzar mis habilidades en programación web, consolidando mi experiencia tanto en Front-end como en Back-end.",
  "about_text_8": "Estas experiencias han complementado mi formación técnica, brindándome una perspectiva integral y habilidades interpersonales esenciales para el trabajo en equipo, la comunicación efectiva, y la gestión de proyectos.",
  "about_text_9": "Con una sólida experiencia en atención al cliente, también he trabajado en roles que requieren habilidades de resolución de problemas, comunicación clara y la capacidad de adaptarse rápidamente a nuevas tecnologías y desafíos.",

  "tec_skills_title_1": "Habilidades Técnicas:",

  "text_skills_tec_1": "Manejo Óptimo de Sistemas",
  "text_skills_tec_2": "Optimización de Procesos",
  "text_skills_tec_3": "Consultoría Informática",
  "text_skills_tec_4": "Asistencia Informática",
  "text_skills_tec_5": "Servicio al Cliente",
  "text_skills_tec_6": "Control de Calidad",
  "text_skills_tec_7": "Soporte Técnico",

  "soft_skills_title_1": "Habilidades Blandas:",

  "text_skills_soft_1": "Pensamiento Lógico y Analítico",
  "text_skills_soft_2": "Comunicación Efectiva",
  "text_skills_soft_3": "Atención a los Detalles",
  "text_skills_soft_4": "Gestión del Tiempo",
  "text_skills_soft_5": "Trabajar en Equipo",
  "text_skills_soft_6": "Adaptabilidad",
  "text_skills_soft_7": "Creatividad",

  "hobbies_title_1": "Hobbies:",

  "text_hobbie_1": "Fotografía",
  "text_hobbie_2": "Fórmula 1",
  "text_hobbie_3": "Béisbol",
  "text_hobbie_4": "Fútbol",
  "text_hobbie_5": "Viajar",
  "text_hobbie_6": "Rock",

  "title_tech_stack_1": "Conjunto de Habilidades Profesionales",

  "title_tool_stack_1": "Herramientas que utilizo",

  "title_github_1": "Historial de Github",

  "title_project_section_1": "Mis Proyectos",

  "subtitle_project_section_1": "A continuación te enseño algunos proyectos en los que he estado trabajando.",
  
  "projects_section": {
    "title_project_10": "MindUp",
    "description_project_10": "Es una plataforma innovadora desarrollada con un enfoque Mobile-First que revoluciona la forma en que los pacientes encuentran a su psicólogo ideal. Conectando a las personas con profesionales que realmente se ajusten a sus necesidades, realizando un cuestionario inicial y perfiles enriquecidos con fotos, videos y descripciones humanas para facilitar relaciones terapéuticas. Construida con tecnologías como Java Spring Boot, PostgreSQL, MongoDB y una arquitectura basada en microservicios, Mindup también integra un sistema de chat en tiempo real para asistencia de emergencia. Priorizando la accesibilidad, personalización y escalabilidad para impactar positivamente en el bienestar mental.",
    "github_project_10": "https://github.com/eduardoe92/MindUp-Backend",
    "link_project_10": "https://mindup-app.vercel.app/",

    "title_project_9": "Bariló",
    "description_project_9": "Bariló es una innovadora Web-App Mobile-First diseñada para transformar la experiencia de los viajes de egresados en Argentina, haciéndolos accesibles y personalizados para todos los estudiantes, sin importar su situación económica. Las empresas de viajes suelen ofrecer paquetes estandarizados, limitando la personalización y accesibilidad. Esta falta de alternativas adecuadas intensifica las desigualdades, resaltando la urgente necesidad de soluciones inclusivas. Tecnologías utilizadas: React, TypeScript, Tailwind CSS, Java, SpringMVC y PostgreSQL.",
    "github_project_9": "https://github.com/eduardoe92/Barilo-App-Front",
    "link_project_9": "https://barilo.vercel.app",

    "title_project_8": "Flowento",
    "description_project_8": "Flowento es una Web-App Mobile-First creada para el Hub de Empresas de Valencia. Centraliza y automatiza la gestión de eventos, resolviendo problemas de procesos manuales, inscripciones por correo y control de asistencia. Utiliza tecnologías como React, Tailwind CSS, Node.js y PostgreSQL. Flowento facilita la creación, difusión, inscripción y seguimiento de eventos, proporcionando métricas en tiempo real y verificación de asistencia, mejorando la eficiencia y rentabilidad de los eventos.",
    "github_project_8": "https://github.com/eduardoe92/Flowento-App-Front",
    "link_project_8": "https://flowento-app.vercel.app",

    "title_project_7": "Frontend Mentor Challenges",
    "description_project_7": "El repositorio Frontend Mentor Challenges se dedica a recrear los diferentes desafíos de la plataforma Frontend Mentor. Su objetivo principal es mejorar las habilidades de desarrollo front-end al abordar proyectos de diseño del mundo real. Cada desafío se encuentra implementado en Vercel. Para obtener más información sobre cada desafío, consulte el correspondiente Readme. Las tecnologías utilizadas incluyen HTML, CSS, JavaScript, React, entre otras.",
    "github_project_7": "https://github.com/eduardoe92/Challenge",
    "link_project_7": "https://eduardoe92.github.io/Challenge/",

    "title_project_6": "QR App",
    "description_project_6": "El proyecto QR App está en constante desarrollo y se centra en la creación de códigos QR. Su objetivo es proporcionar a los usuarios una experiencia fluida, amigable y agradable para generar códigos QR fácilmente para diversas aplicaciones. Con el tiempo, se agregarán más funciones para mejorar la experiencia de navegación. La aplicación está implementada en Vercel y utiliza tecnologías como React-Vite, JavaScript, Tailwind CSS, HTML y CSS",
    "github_project_6": "https://github.com/eduardoe92/URL",
    "link_project_6": "https://urlqr.vercel.app/",

    "title_project_5": "Librería",
    "description_project_5": "El proyecto Biblioteca es una aplicación para gestionar una biblioteca digital. Permite a los usuarios registrar, actualizar y gestionar libros, autores y cuentas de usuario. Incluye características como registro de usuarios, gestión de libros y autores, seguridad de contraseñas, control de sesiones y roles de usuario. Utiliza Java, Spring Boot, Spring Security, Spring Data JPA, MySQL, Maven, HTML y Bootstrap para ofrecer una plataforma segura y funcional.",
    "github_project_5": "https://github.com/eduardoe92/LibraryProject",
    "link_project_5": "",

    "title_project_4": "Makisan Tech",
    "description_project_4": "La Landing Page de Makisan-Tech, desarrollada con HTML, CSS y JavaScript, fue el resultado de una colaboración estrecha con un equipo de desarrolladores front-end. El objetivo principal fue optimizar la experiencia del usuario, asegurando una navegación fluida y una presentación atractiva que reflejara los valores de la empresa. Esto se logró mediante un diseño intuitivo y una estructura bien organizada que facilita el acceso a la información.",
    "github_project_4": "https://github.com/eduardoe92/web-makisan-tech",
    "link_project_4": "https://jonathansansok.github.io/web-makisan-tech/",

    "title_project_3": "Caroline Sada",
    "description_project_3": "El Proyecto de Digital Nao consistió en la creación de una Landing Page para 'Caroline Sada', profesional en Administración y Dirección de Empresas. Se emplearon tecnologías HTML, CSS y Bootstrap para su desarrollo, garantizando una presentación elegante y funcional. El sitio web resalta las habilidades y servicios ofrecidos por la licenciada, permitiendo a los visitantes obtener una impresión clara y profesional de sus capacidades.",
    "github_project_3": "https://github.com/eduardoe92/CarolineSada",
    "link_project_3": "https://eduardoe92.github.io/CarolineSada/",

    "title_project_2": "Pokedex",
    "description_project_2": "El Proyecto Pokedex, desarrollado con React, utiliza la API de Pokemon para brindar a los usuarios acceso a las especificaciones de sus Pokémon favoritos. Esta aplicación está alojada en Vercel, garantizando una experiencia fluida y confiable. Con un enfoque en la usabilidad y la precisión de los datos, el Proyecto Pokedex es una herramienta invaluable tanto para los entusiastas de Pokémon como para los desarrolladores. La interfaz es intuitiva y fácil de usar.",
    "github_project_2": "https://github.com/eduardoe92/Pokedex",
    "link_project_2": "https://pokedex-eduardoe92.vercel.app/",

    "title_project_1": "Rick and Morty",
    "description_project_1": "El Proyecto Rick and Morty, desarrollado con React para la interfaz y utilizando la API de la serie, proporciona a los usuarios información detallada sobre cada personaje. La aplicación está implementada en Vercel, asegurando una plataforma interactiva, fluida, agradable y confiable para los fans. Permite explorar el universo de la serie de manera detallada y divertida, ofreciendo una experiencia de usuario enriquecedora y entretenida.",
    "github_project_1": "https://github.com/eduardoe92/ApiRickAndMorty",
    "link_project_1": "https://rickandmorty-seven-virid.vercel.app/"
  },

  "Deployer": "Desplegar",

  "contact_title_1": "Gracias por querer comunicarte conmigo",

  "contact_text_1": "Estoy a tu disposición para abordar cualquier pregunta o inquietud que puedas tener.",
  "contact_text_2": "Si deseas ponerte en contacto conmigo, puedes hacerlo a través de mis redes sociales.",
  "contact_text_3": "Por favor, ten en cuenta que mi disponibilidad puede variar, pero haré todo lo posible por responder a tu mensaje en el menor tiempo posible.",
  "contact_text_4": "¡Espero tener noticias tuyas pronto!",
  "contact_text_5": "Saludos cordiales.",

  "form": {
    "form_name": "Nombre:",
    "form_email": "Correo:",
    "form_subject": "Mensaje:",

    "alert_send": "Mensaje enviado con éxito",
    "alert_fail": "Hubo un problema al enviar el mensaje.",

    "form_pre_send": "Enviar",
    "form_sending": "Enviando...",
    "form_error": "Error al enviar",
    "form_send": "Enviado"
  },

  "contact_icon_title_1": "Encuéntrame en mis redes sociales",

  "contact_icon_subtitle_1": "No dudes en contactarte conmigo"
}
